{
        "heading": "Croatian Coasts",
        "technologies": "PHP, CSS, HTML",
        "description": "A PHP themeing project based on designs from a high-end resort chain from Croatia.",
        "thumbnail": "images/project-image3.jpg",
        "url": "https://peprojects.dev/alpha-3/josh/projects/layout-theme-challenge/",
        "slug": "123",
        "case-study":
        {
            "sections":
            [
                {
                    "module": "project-links",
                    "github": "https://github.com/JoshBenjaminG/Theme-Challenge/tree/main/layout-theme-challenge",
                    "site_link": "https://peprojects.dev/alpha-3/josh/projects/layout-theme-challenge/"
                },
                {
                    "module": "image",
                    "img": "images/research-picture.jpg",
                    "caption": "<p class='caption'>Unslpash has always been a good resource, and is usually where I get images for these projects from.</p>",
                    "description": "<p>I like to begin the research phase by looking at content choices from free resources like Unslpash.com and websites that are similar to the niche I am looking at. In this image, I have added some images and sections taken from different websites to serve as a folder for inspiration.</p>"
                },
                {
                    "module": "image",
                    "img": "images/project-image-99.jpg",
                    "caption": "<p class='caption'>Eric Meyer knows a lot about CSS, and this is a really good reset. You need a good reset to reduce browser inconsistencies. The link to the reset can be found <a href='https://meyerweb.com/eric/tools/css/reset/'>here.</a></p>",
                    "description": "<p>This is the first mockup where I get a layout in place. I've done several of these as practice. This boilerplate contains the basic file structure as well, such as a css folder that contains typography choices, structure, and a css reset so that there are no default styles. Of course, there is some sort of default so you have to make some choices as to what things should look like. In this case, I am using the Meyer CSS reset.</p>"
                },
                {
                    "module": "image",
                    "img": "images/style-tilecasestudy1.jpg",
                    "caption": "<p class='caption'></p>",
                    "description": "<p>The website layout represents a combination of the content I compiled from Unsplash as well as the inspiration I got from looking at similar sites. I use a simple banner, some call to actions, and an article card grid. Just lists of things arranged in different orders!</p>"
                },
                {
                    "module": "image",
                    "img": "images/project-image-index.jpg",
                    "caption": "<p class='caption'>This is just a basic PHP router. Nothing to see here. At this point I've added the module folders that contain the css and html. I'll use these to pull in JSON to populate each module.</p>",
                    "description": "<p></p>"
                },
                {
                    "module": "image",
                    "img": "images/project-image-functions.jpg",
                    "caption": "<p class='caption'>'The important part is that the code works' - Abraham Lincoln</p>",
                    "description": "<p>When I was done with the basic layout, I added a little bit of CRUD functionality. Does this site really need it? Not really... but I need the PHP practice. This basically allows you to add and remove article cards. Could be a decent basis for a CMS though! But a regular CMS would be better for this type of project, or no CMS at all! It's just a basic landing page, maybe the owner doesn't need to control everything...</p>"
                },
                {
                    "module": "project-links",
                    "github": "https://github.com/JoshBenjaminG/Theme-Challenge/tree/main/layout-theme-challenge",
                    "site_link": "https://peprojects.dev/alpha-3/josh/projects/layout-theme-challenge/"
                }
            ]
        }
    },